{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"labels": {"name": "progan/labels_in:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "0"}]}}, "latents": {"name": "progan/latents_in:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"concat": {"name": "progan/Run/concat/concat:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "1024"}, {"size": "1024"}]}}}}, "modelTopology": {"node": [{"name": "progan/ToRGB_lod8/weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/ToRGB_lod8/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/Less", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "progan/Run/progan/4x4/Conv/LeakyRelu/alpha", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/LeakyRelu/alpha", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/concat/axis", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/PixelNorm/Mean/reduction_indices", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/PixelNorm/add/y", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/mul", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "8192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/Reshape/shape", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/Dense/Reshape_1", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/PixelNorm/Mean/reduction_indices", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/Dense/PixelNorm/add/y", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/transpose/perm", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/Conv/mul", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/transpose_1/perm", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/Conv/Reshape", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/PixelNorm/Mean/reduction_indices", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/Conv/PixelNorm/add/y", "op": "Const", "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/labels_in", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "0"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/latents_in", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/progan/ToRGB_lod8/weight/_55", "op": "Switch", "input": ["progan/ToRGB_lod8/weight", "progan/Run/progan/Less"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/progan/ToRGB_lod8/bias/_56", "op": "Switch", "input": ["progan/ToRGB_lod8/bias", "progan/Run/progan/Less"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/concat", "op": "ConcatV2", "input": ["progan/latents_in", "progan/labels_in", "progan/Run/progan/concat/axis"], "device": "/device:CPU:0", "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "progan/Run/progan/4x4/PixelNorm/Square", "op": "Square", "input": ["progan/Run/progan/concat"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/PixelNorm/Mean", "op": "Mean", "input": ["progan/Run/progan/4x4/PixelNorm/Square", "progan/Run/progan/4x4/PixelNorm/Mean/reduction_indices"], "device": "/device:CPU:0", "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/PixelNorm/add", "op": "AddV2", "input": ["progan/Run/progan/4x4/PixelNorm/Mean", "progan/Run/progan/4x4/PixelNorm/add/y"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/PixelNorm/Rsqrt", "op": "Rsqrt", "input": ["progan/Run/progan/4x4/PixelNorm/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/PixelNorm/mul", "op": "Mul", "input": ["progan/Run/progan/concat", "progan/Run/progan/4x4/PixelNorm/Rsqrt"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/MatMul", "op": "MatMul", "input": ["progan/Run/progan/4x4/PixelNorm/mul", "progan/Run/progan/4x4/Dense/mul"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "progan/Run/progan/4x4/Dense/Reshape", "op": "Reshape", "input": ["progan/Run/progan/4x4/Dense/MatMul", "progan/Run/progan/4x4/Dense/Reshape/shape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/4x4/Dense/add", "op": "AddV2", "input": ["progan/Run/progan/4x4/Dense/Reshape", "progan/Run/progan/4x4/Dense/Reshape_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/LeakyRelu/mul", "op": "Mul", "input": ["progan/Run/progan/4x4/Dense/add", "progan/Run/progan/4x4/Dense/LeakyRelu/alpha"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/LeakyRelu/Maximum", "op": "Maximum", "input": ["progan/Run/progan/4x4/Dense/LeakyRelu/mul", "progan/Run/progan/4x4/Dense/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/PixelNorm/Square", "op": "Square", "input": ["progan/Run/progan/4x4/Dense/LeakyRelu/Maximum"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/PixelNorm/Mean", "op": "Mean", "input": ["progan/Run/progan/4x4/Dense/PixelNorm/Square", "progan/Run/progan/4x4/Dense/PixelNorm/Mean/reduction_indices"], "device": "/device:CPU:0", "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/PixelNorm/add", "op": "AddV2", "input": ["progan/Run/progan/4x4/Dense/PixelNorm/Mean", "progan/Run/progan/4x4/Dense/PixelNorm/add/y"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/PixelNorm/Rsqrt", "op": "Rsqrt", "input": ["progan/Run/progan/4x4/Dense/PixelNorm/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Dense/PixelNorm/mul", "op": "Mul", "input": ["progan/Run/progan/4x4/Dense/LeakyRelu/Maximum", "progan/Run/progan/4x4/Dense/PixelNorm/Rsqrt"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/transpose", "op": "Transpose", "input": ["progan/Run/progan/4x4/Dense/PixelNorm/mul", "progan/Run/progan/4x4/Conv/transpose/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/Conv2D", "op": "Conv2D", "input": ["progan/Run/progan/4x4/Conv/transpose", "progan/Run/progan/4x4/Conv/mul"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "progan/Run/progan/4x4/Conv/transpose_1", "op": "Transpose", "input": ["progan/Run/progan/4x4/Conv/Conv2D", "progan/Run/progan/4x4/Conv/transpose_1/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/add", "op": "AddV2", "input": ["progan/Run/progan/4x4/Conv/transpose_1", "progan/Run/progan/4x4/Conv/Reshape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/LeakyRelu/mul", "op": "Mul", "input": ["progan/Run/progan/4x4/Conv/add", "progan/Run/progan/4x4/Conv/LeakyRelu/alpha"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/LeakyRelu/Maximum", "op": "Maximum", "input": ["progan/Run/progan/4x4/Conv/LeakyRelu/mul", "progan/Run/progan/4x4/Conv/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/PixelNorm/Square", "op": "Square", "input": ["progan/Run/progan/4x4/Conv/LeakyRelu/Maximum"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/PixelNorm/Mean", "op": "Mean", "input": ["progan/Run/progan/4x4/Conv/PixelNorm/Square", "progan/Run/progan/4x4/Conv/PixelNorm/Mean/reduction_indices"], "device": "/device:CPU:0", "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/PixelNorm/add", "op": "AddV2", "input": ["progan/Run/progan/4x4/Conv/PixelNorm/Mean", "progan/Run/progan/4x4/Conv/PixelNorm/add/y"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/PixelNorm/Rsqrt", "op": "Rsqrt", "input": ["progan/Run/progan/4x4/Conv/PixelNorm/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/4x4/Conv/PixelNorm/mul", "op": "Mul", "input": ["progan/Run/progan/4x4/Conv/LeakyRelu/Maximum", "progan/Run/progan/4x4/Conv/PixelNorm/Rsqrt"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/progan/Run/progan/4x4/Conv/PixelNorm/mul/_5", "op": "Switch", "input": ["progan/Run/progan/4x4/Conv/PixelNorm/mul", "progan/Run/progan/Less"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/Less", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_100", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_101", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_102", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_103", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_104", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_105", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_106", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_107", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_108", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_109", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_110", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_111", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/Greater", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_65", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_66", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_67", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_68", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_69", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_70", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_71", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_72", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_73", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_74", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_75", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_76", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_77", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_78", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_79", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_80", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_81", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_82", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_83", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_84", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_85", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_86", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_87", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_88", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_89", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_90", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_91", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_92", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_93", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_94", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_95", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_96", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_97", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_98", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "Func/progan/Run/progan/cond/then/_0/input/_99", "op": "NoOp", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"]}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/LeakyRelu/alpha", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/LeakyRelu/alpha", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape/shape", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Tile/multiples", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape_1/shape", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/transpose/perm", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/mul", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/transpose_1/perm", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/Reshape", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Mean/reduction_indices", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/add/y", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/transpose/perm", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/mul", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/transpose_1/perm", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/Reshape", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Mean/reduction_indices", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/add/y", "op": "Const", "input": ["^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/switch_pred/_2", "op": "Switch", "input": ["progan/Run/progan/Less", "progan/Run/progan/Less", "^progan/Run/progan/4x4/Conv/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/Func/progan/Run/progan/cond/then/_0/input/_60/_222", "op": "Switch", "input": ["progan/Run/progan/cond/progan/Run/progan/4x4/Conv/PixelNorm/mul/_5:1", "progan/Run/progan/cond/then/_0/Less"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/Func/progan/Run/progan/cond/then/_0/input/_108/_218", "op": "Switch", "input": ["Func/progan/Run/progan/cond/then/_0/input/_108", "progan/Run/progan/cond/then/_0/Less"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/Func/progan/Run/progan/cond/then/_0/input/_109/_219", "op": "Switch", "input": ["Func/progan/Run/progan/cond/then/_0/input/_109", "progan/Run/progan/cond/then/_0/Less"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/Func/progan/Run/progan/cond/then/_0/input/_110/_221", "op": "Switch", "input": ["Func/progan/Run/progan/cond/then/_0/input/_110", "progan/Run/progan/cond/then/_0/Less"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/Func/progan/Run/progan/cond/then/_0/input/_111/_223", "op": "Switch", "input": ["Func/progan/Run/progan/cond/then/_0/input/_111", "progan/Run/progan/cond/then/_0/Less"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/progan/Run/progan/cond/then/_0/Greater/_220", "op": "Switch", "input": ["progan/Run/progan/cond/then/_0/Greater", "progan/Run/progan/cond/then/_0/Less"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/Func/progan/Run/progan/cond/then/_0/input/_65/_179", "op": "Switch", "input": ["Func/progan/Run/progan/cond/then/_0/input/_65", "progan/Run/progan/cond/then/_0/Less"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape", "op": "Reshape", "input": ["progan/Run/progan/cond/progan/Run/progan/4x4/Conv/PixelNorm/mul/_5:1", "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape/shape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/pivot_f/_3", "op": "Identity", "input": ["progan/Run/progan/cond/switch_pred/_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Tile", "op": "Tile", "input": ["progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape", "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Tile/multiples"], "device": "/device:CPU:0", "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose/perm", "op": "Const", "input": ["^progan/Run/progan/cond/pivot_f/_3"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/progan/Run/progan/cond/else/_1/input/_165", "op": "Identity", "input": ["progan/Run/progan/cond/progan/ToRGB_lod8/weight/_55", "^progan/Run/progan/cond/pivot_f/_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/wscale", "op": "Const", "input": ["^progan/Run/progan/cond/pivot_f/_3"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose_1/perm", "op": "Const", "input": ["^progan/Run/progan/cond/pivot_f/_3"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/progan/Run/progan/cond/else/_1/input/_166", "op": "Identity", "input": ["progan/Run/progan/cond/progan/ToRGB_lod8/bias/_56", "^progan/Run/progan/cond/pivot_f/_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/Reshape/shape", "op": "Const", "input": ["^progan/Run/progan/cond/pivot_f/_3"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/else/_1/Upscale2D/Reshape/shape", "op": "Const", "input": ["^progan/Run/progan/cond/pivot_f/_3"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/else/_1/Upscale2D/Tile/multiples", "op": "Const", "input": ["^progan/Run/progan/cond/pivot_f/_3"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/else/_1/Upscale2D/Reshape_1/shape", "op": "Const", "input": ["^progan/Run/progan/cond/pivot_f/_3"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape_1", "op": "Reshape", "input": ["progan/Run/progan/cond/then/_0/8x8/Upscale2D/Tile", "progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape_1/shape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose", "op": "Transpose", "input": ["progan/Run/progan/cond/progan/Run/progan/4x4/Conv/PixelNorm/mul/_5", "progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/mul", "op": "Mul", "input": ["Func/progan/Run/progan/cond/else/_1/input/_165", "progan/Run/progan/cond/else/_1/ToRGB_lod8/wscale"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/Reshape", "op": "Reshape", "input": ["Func/progan/Run/progan/cond/else/_1/input/_166", "progan/Run/progan/cond/else/_1/ToRGB_lod8/Reshape/shape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/transpose", "op": "Transpose", "input": ["progan/Run/progan/cond/then/_0/8x8/Upscale2D/Reshape_1", "progan/Run/progan/cond/then/_0/8x8/Conv0/transpose/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/Conv2D", "op": "Conv2D", "input": ["progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose", "progan/Run/progan/cond/else/_1/ToRGB_lod8/mul"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/Conv2D", "op": "Conv2D", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/transpose", "progan/Run/progan/cond/then/_0/8x8/Conv0/mul"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose_1", "op": "Transpose", "input": ["progan/Run/progan/cond/else/_1/ToRGB_lod8/Conv2D", "progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose_1/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/transpose_1", "op": "Transpose", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/Conv2D", "progan/Run/progan/cond/then/_0/8x8/Conv0/transpose_1/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/ToRGB_lod8/add", "op": "AddV2", "input": ["progan/Run/progan/cond/else/_1/ToRGB_lod8/transpose_1", "progan/Run/progan/cond/else/_1/ToRGB_lod8/Reshape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/add", "op": "AddV2", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/transpose_1", "progan/Run/progan/cond/then/_0/8x8/Conv0/Reshape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/Upscale2D/Reshape", "op": "Reshape", "input": ["progan/Run/progan/cond/else/_1/ToRGB_lod8/add", "progan/Run/progan/cond/else/_1/Upscale2D/Reshape/shape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/LeakyRelu/mul", "op": "Mul", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/add", "progan/Run/progan/cond/then/_0/8x8/Conv0/LeakyRelu/alpha"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/Upscale2D/Tile", "op": "Tile", "input": ["progan/Run/progan/cond/else/_1/Upscale2D/Reshape", "progan/Run/progan/cond/else/_1/Upscale2D/Tile/multiples"], "device": "/device:CPU:0", "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/LeakyRelu/Maximum", "op": "Maximum", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/LeakyRelu/mul", "progan/Run/progan/cond/then/_0/8x8/Conv0/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/else/_1/Upscale2D/Reshape_1", "op": "Reshape", "input": ["progan/Run/progan/cond/else/_1/Upscale2D/Tile", "progan/Run/progan/cond/else/_1/Upscale2D/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Square", "op": "Square", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/LeakyRelu/Maximum"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Mean", "op": "Mean", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Square", "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Mean/reduction_indices"], "device": "/device:CPU:0", "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/add", "op": "AddV2", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Mean", "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/add/y"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Rsqrt", "op": "Rsqrt", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/mul", "op": "Mul", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/LeakyRelu/Maximum", "progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/Rsqrt"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/transpose", "op": "Transpose", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv0/PixelNorm/mul", "progan/Run/progan/cond/then/_0/8x8/Conv1/transpose/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/Conv2D", "op": "Conv2D", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/transpose", "progan/Run/progan/cond/then/_0/8x8/Conv1/mul"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/transpose_1", "op": "Transpose", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/Conv2D", "progan/Run/progan/cond/then/_0/8x8/Conv1/transpose_1/perm"], "device": "/device:CPU:0", "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/add", "op": "AddV2", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/transpose_1", "progan/Run/progan/cond/then/_0/8x8/Conv1/Reshape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/LeakyRelu/mul", "op": "Mul", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/add", "progan/Run/progan/cond/then/_0/8x8/Conv1/LeakyRelu/alpha"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/LeakyRelu/Maximum", "op": "Maximum", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/LeakyRelu/mul", "progan/Run/progan/cond/then/_0/8x8/Conv1/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Square", "op": "Square", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/LeakyRelu/Maximum"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Mean", "op": "Mean", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Square", "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Mean/reduction_indices"], "device": "/device:CPU:0", "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/add", "op": "AddV2", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Mean", "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/add/y"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Rsqrt", "op": "Rsqrt", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/add"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/mul", "op": "Mul", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/LeakyRelu/Maximum", "progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/Rsqrt"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/mul/_174", "op": "Switch", "input": ["progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/mul", "progan/Run/progan/cond/then/_0/Less"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/pivot_t/_173", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/mul", "^Func/progan/Run/progan/cond/then/_0/input/_100", "^Func/progan/Run/progan/cond/then/_0/input/_101", "^Func/progan/Run/progan/cond/then/_0/input/_102", "^Func/progan/Run/progan/cond/then/_0/input/_103", "^Func/progan/Run/progan/cond/then/_0/input/_104", "^Func/progan/Run/progan/cond/then/_0/input/_105", "^Func/progan/Run/progan/cond/then/_0/input/_106", "^Func/progan/Run/progan/cond/then/_0/input/_107", "^Func/progan/Run/progan/cond/then/_0/input/_108", "^Func/progan/Run/progan/cond/then/_0/input/_109", "^Func/progan/Run/progan/cond/then/_0/input/_110", "^Func/progan/Run/progan/cond/then/_0/input/_111", "^progan/Run/progan/cond/then/_0/Greater", "^Func/progan/Run/progan/cond/then/_0/input/_65", "^Func/progan/Run/progan/cond/then/_0/input/_66", "^Func/progan/Run/progan/cond/then/_0/input/_67", "^Func/progan/Run/progan/cond/then/_0/input/_68", "^Func/progan/Run/progan/cond/then/_0/input/_69", "^Func/progan/Run/progan/cond/then/_0/input/_70", "^Func/progan/Run/progan/cond/then/_0/input/_71", "^Func/progan/Run/progan/cond/then/_0/input/_72", "^Func/progan/Run/progan/cond/then/_0/input/_73", "^Func/progan/Run/progan/cond/then/_0/input/_74", "^Func/progan/Run/progan/cond/then/_0/input/_75", "^Func/progan/Run/progan/cond/then/_0/input/_76", "^Func/progan/Run/progan/cond/then/_0/input/_77", "^Func/progan/Run/progan/cond/then/_0/input/_78", "^Func/progan/Run/progan/cond/then/_0/input/_79", "^Func/progan/Run/progan/cond/then/_0/input/_80", "^Func/progan/Run/progan/cond/then/_0/input/_81", "^Func/progan/Run/progan/cond/then/_0/input/_82", "^Func/progan/Run/progan/cond/then/_0/input/_83", "^Func/progan/Run/progan/cond/then/_0/input/_84", "^Func/progan/Run/progan/cond/then/_0/input/_85", "^Func/progan/Run/progan/cond/then/_0/input/_86", "^Func/progan/Run/progan/cond/then/_0/input/_87", "^Func/progan/Run/progan/cond/then/_0/input/_88", "^Func/progan/Run/progan/cond/then/_0/input/_89", "^Func/progan/Run/progan/cond/then/_0/input/_90", "^Func/progan/Run/progan/cond/then/_0/input/_91", "^Func/progan/Run/progan/cond/then/_0/input/_92", "^Func/progan/Run/progan/cond/then/_0/input/_93", "^Func/progan/Run/progan/cond/then/_0/input/_94", "^Func/progan/Run/progan/cond/then/_0/input/_95", "^Func/progan/Run/progan/cond/then/_0/input/_96", "^Func/progan/Run/progan/cond/then/_0/input/_97", "^Func/progan/Run/progan/cond/then/_0/input/_98", "^Func/progan/Run/progan/cond/then/_0/input/_99"], "device": "/device:CPU:0"}, {"name": "progan/Run/progan/cond/then/_0/cond/switch_pred/_171", "op": "Switch", "input": ["progan/Run/progan/cond/then/_0/Less", "progan/Run/progan/cond/then/_0/Less", "^Func/progan/Run/progan/cond/then/_0/input/_100", "^Func/progan/Run/progan/cond/then/_0/input/_101", "^Func/progan/Run/progan/cond/then/_0/input/_102", "^Func/progan/Run/progan/cond/then/_0/input/_103", "^Func/progan/Run/progan/cond/then/_0/input/_104", "^Func/progan/Run/progan/cond/then/_0/input/_105", "^Func/progan/Run/progan/cond/then/_0/input/_106", "^Func/progan/Run/progan/cond/then/_0/input/_107", "^Func/progan/Run/progan/cond/then/_0/input/_108", "^Func/progan/Run/progan/cond/then/_0/input/_109", "^Func/progan/Run/progan/cond/then/_0/input/_110", "^Func/progan/Run/progan/cond/then/_0/input/_111", "^progan/Run/progan/cond/then/_0/Greater", "^Func/progan/Run/progan/cond/then/_0/input/_65", "^Func/progan/Run/progan/cond/then/_0/input/_66", "^Func/progan/Run/progan/cond/then/_0/input/_67", "^Func/progan/Run/progan/cond/then/_0/input/_68", "^Func/progan/Run/progan/cond/then/_0/input/_69", "^Func/progan/Run/progan/cond/then/_0/input/_70", "^Func/progan/Run/progan/cond/then/_0/input/_71", "^Func/progan/Run/progan/cond/then/_0/input/_72", "^Func/progan/Run/progan/cond/then/_0/input/_73", "^Func/progan/Run/progan/cond/then/_0/input/_74", "^Func/progan/Run/progan/cond/then/_0/input/_75", "^Func/progan/Run/progan/cond/then/_0/input/_76", "^Func/progan/Run/progan/cond/then/_0/input/_77", "^Func/progan/Run/progan/cond/then/_0/input/_78", "^Func/progan/Run/progan/cond/then/_0/input/_79", "^Func/progan/Run/progan/cond/then/_0/input/_80", "^Func/progan/Run/progan/cond/then/_0/input/_81", "^Func/progan/Run/progan/cond/then/_0/input/_82", "^Func/progan/Run/progan/cond/then/_0/input/_83", "^Func/progan/Run/progan/cond/then/_0/input/_84", "^Func/progan/Run/progan/cond/then/_0/input/_85", "^Func/progan/Run/progan/cond/then/_0/input/_86", "^Func/progan/Run/progan/cond/then/_0/input/_87", "^Func/progan/Run/progan/cond/then/_0/input/_88", "^Func/progan/Run/progan/cond/then/_0/input/_89", "^Func/progan/Run/progan/cond/then/_0/input/_90", "^Func/progan/Run/progan/cond/then/_0/input/_91", "^Func/progan/Run/progan/cond/then/_0/input/_92", "^Func/progan/Run/progan/cond/then/_0/input/_93", "^Func/progan/Run/progan/cond/then/_0/input/_94", "^Func/progan/Run/progan/cond/then/_0/input/_95", "^Func/progan/Run/progan/cond/then/_0/input/_96", "^Func/progan/Run/progan/cond/then/_0/input/_97", "^Func/progan/Run/progan/cond/then/_0/input/_98", "^Func/progan/Run/progan/cond/then/_0/input/_99", "^progan/Run/progan/cond/then/_0/8x8/Conv1/PixelNorm/mul"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/then/_169/Less", "op": "Const", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "progan/Run/progan/cond/then/_0/cond/then/_169/Greater", "op": "Const", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"], "device": "/device:CPU:0", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_232", "op": "Const", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_233", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_234", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_235", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_236", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_237", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_238", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_239", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_240", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_241", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_242", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_243", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_244", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_245", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_246", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_247", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_248", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_249", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_250", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_251", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_252", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_253", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_254", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_255", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_256", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_257", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_258", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_259", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": "Func/progan/Run/progan/cond/then/_0/cond/then/_169/input/_260", "op": "NoOp", "input": ["^progan/Run/progan/cond/then/_0/cond/pivot_t/_173"]}, {"name": 